FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M7_SAMV71_Xplained_IAR_Keil/libchip_samv7/include/samv7/component/component_xdmac.h
/* ---------------------------------------------------------------------------- */
/*                  Atmel Microcontroller Software Support                      */
/*                       SAM Software Package License                           */
/* ---------------------------------------------------------------------------- */
/* Copyright (c) 2014, Atmel Corporation                                        */
/*                                                                              */
/* All rights reserved.                                                         */
/*                                                                              */
/* Redistribution and use in source and binary forms, with or without           */
/* modification, are permitted provided that the following condition is met:    */
/*                                                                              */
/* - Redistributions of source code must retain the above copyright notice,     */
/* this list of conditions and the disclaimer below.                            */
/*                                                                              */
/* Atmel's name may not be used to endorse or promote products derived from     */
/* this software without specific prior written permission.                     */
/*                                                                              */
/* DISCLAIMER:  THIS SOFTWARE IS PROVIDED BY ATMEL "AS IS" AND ANY EXPRESS OR   */
/* IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF */
/* MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT ARE   */
/* DISCLAIMED. IN NO EVENT SHALL ATMEL BE LIABLE FOR ANY DIRECT, INDIRECT,      */
/* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT */
/* LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA,  */
/* OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF    */
/* LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING         */
/* NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, */
/* EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.                           */
/* ---------------------------------------------------------------------------- */

#ifndef _SAM_XDMAC_COMPONENT_
#define _SAM_XDMAC_COMPONENT_

/* ============================================================================= */
/**  SOFTWARE API DEFINITION FOR Extensible DMA Controller */
/* ============================================================================= */
/** \addtogroup SAM_XDMAC Extensible DMA Controller */
/*@{*/

#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
/** \brief XdmacChid hardware registers */
    typedef struct
    {
        __O uint32_t XDMAC_CIE;      /**< \brief (XdmacChid Offset: 0x0) Channel Interrupt Enable Register */
        __O uint32_t XDMAC_CID;      /**< \brief (XdmacChid Offset: 0x4) Channel Interrupt Disable Register */
        __O uint32_t XDMAC_CIM;      /**< \brief (XdmacChid Offset: 0x8) Channel Interrupt Mask Register */
        __I uint32_t XDMAC_CIS;      /**< \brief (XdmacChid Offset: 0xC) Channel Interrupt Status Register */
        __IO uint32_t XDMAC_CSA;     /**< \brief (XdmacChid Offset: 0x10) Channel Source Address Register */
        __IO uint32_t XDMAC_CDA;     /**< \brief (XdmacChid Offset: 0x14) Channel Destination Address Register */
        __IO uint32_t XDMAC_CNDA;    /**< \brief (XdmacChid Offset: 0x18) Channel Next Descriptor Address Register */
        __IO uint32_t XDMAC_CNDC;    /**< \brief (XdmacChid Offset: 0x1C) Channel Next Descriptor Control Register */
        __IO uint32_t XDMAC_CUBC;    /**< \brief (XdmacChid Offset: 0x20) Channel Microblock Control Register */
        __IO uint32_t XDMAC_CBC;     /**< \brief (XdmacChid Offset: 0x24) Channel Block Control Register */
        __IO uint32_t XDMAC_CC;      /**< \brief (XdmacChid Offset: 0x28) Channel Configuration Register */
        __IO uint32_t XDMAC_CDS_MSP; /**< \brief (XdmacChid Offset: 0x2C) Channel Data Stride Memory Set Pattern */
        __IO uint32_t XDMAC_CSUS;    /**< \brief (XdmacChid Offset: 0x30) Channel Source Microblock Stride */
        __IO uint32_t XDMAC_CDUS;    /**< \brief (XdmacChid Offset: 0x34) Channel Destination Microblock Stride */
        __I uint32_t Reserved1[ 2 ];
    } XdmacChid;
/** \brief Xdmac hardware registers */
    #define XDMACCHID_NUMBER    24
    typedef struct
    {
        __IO uint32_t XDMAC_GTYPE;                /**< \brief (Xdmac Offset: 0x00) Global Type Register */
        __I uint32_t XDMAC_GCFG;                  /**< \brief (Xdmac Offset: 0x04) Global Configuration Register */
        __IO uint32_t XDMAC_GWAC;                 /**< \brief (Xdmac Offset: 0x08) Global Weighted Arbiter Configuration Register */
        __O uint32_t XDMAC_GIE;                   /**< \brief (Xdmac Offset: 0x0C) Global Interrupt Enable Register */
        __O uint32_t XDMAC_GID;                   /**< \brief (Xdmac Offset: 0x10) Global Interrupt Disable Register */
        __I uint32_t XDMAC_GIM;                   /**< \brief (Xdmac Offset: 0x14) Global Interrupt Mask Register */
        __I uint32_t XDMAC_GIS;                   /**< \brief (Xdmac Offset: 0x18) Global Interrupt Status Register */
        __O uint32_t XDMAC_GE;                    /**< \brief (Xdmac Offset: 0x1C) Global Channel Enable Register */
        __O uint32_t XDMAC_GD;                    /**< \brief (Xdmac Offset: 0x20) Global Channel Disable Register */
        __I uint32_t XDMAC_GS;                    /**< \brief (Xdmac Offset: 0x24) Global Channel Status Register */
        __IO uint32_t XDMAC_GRS;                  /**< \brief (Xdmac Offset: 0x28) Global Channel Read Suspend Register */
        __IO uint32_t XDMAC_GWS;                  /**< \brief (Xdmac Offset: 0x2C) Global Channel Write Suspend Register */
        __O uint32_t XDMAC_GRWS;                  /**< \brief (Xdmac Offset: 0x30) Global Channel Read Write Suspend Register */
        __O uint32_t XDMAC_GRWR;                  /**< \brief (Xdmac Offset: 0x34) Global Channel Read Write Resume Register */
        __O uint32_t XDMAC_GSWR;                  /**< \brief (Xdmac Offset: 0x38) Global Channel Software Request Register */
        __I uint32_t XDMAC_GSWS;                  /**< \brief (Xdmac Offset: 0x3C) Global Channel Software Request Status Register */
        __O uint32_t XDMAC_GSWF;                  /**< \brief (Xdmac Offset: 0x40) Global Channel Software Flush Request Register */
        __I uint32_t Reserved1[ 3 ];
        XdmacChid XDMAC_CHID[ XDMACCHID_NUMBER ]; /**< \brief (Xdmac Offset: 0x50) chid = 0 .. 23 */
        __I uint32_t Reserved2[ 619 ];
        __IO uint32_t XDMAC_VERSION;              /**< \brief (Xdmac Offset: 0xFFC) XDMAC Version Register */
    } Xdmac;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */
/* -------- XDMAC_GTYPE : (XDMAC Offset: 0x00) Global Type Register -------- */
#define XDMAC_GTYPE_NB_CH_Pos                      0
#define XDMAC_GTYPE_NB_CH_Msk                      ( 0x1fu << XDMAC_GTYPE_NB_CH_Pos ) /**< \brief (XDMAC_GTYPE) Number of Channels Minus One */
#define XDMAC_GTYPE_NB_CH( value )      ( ( XDMAC_GTYPE_NB_CH_Msk & ( ( value ) << XDMAC_GTYPE_NB_CH_Pos ) ) )
#define XDMAC_GTYPE_FIFO_SZ_Pos                    5
#define XDMAC_GTYPE_FIFO_SZ_Msk                    ( 0x7ffu << XDMAC_GTYPE_FIFO_SZ_Pos ) /**< \brief (XDMAC_GTYPE) Number of Bytes */
#define XDMAC_GTYPE_FIFO_SZ( value )    ( ( XDMAC_GTYPE_FIFO_SZ_Msk & ( ( value ) << XDMAC_GTYPE_FIFO_SZ_Pos ) ) )
#define XDMAC_GTYPE_NB_REQ_Pos                     16
#define XDMAC_GTYPE_NB_REQ_Msk                     ( 0x7fu << XDMAC_GTYPE_NB_REQ_Pos ) /**< \brief (XDMAC_GTYPE) Number of Peripheral Requests Minus One */
#define XDMAC_GTYPE_NB_REQ( value )     ( ( XDMAC_GTYPE_NB_REQ_Msk & ( ( value ) << XDMAC_GTYPE_NB_REQ_Pos ) ) )
/* -------- XDMAC_GCFG : (XDMAC Offset: 0x04) Global Configuration Register -------- */
#define XDMAC_GCFG_CGDISREG                        ( 0x1u << 0 ) /**< \brief (XDMAC_GCFG) Configuration Registers Clock Gating Disable */
#define XDMAC_GCFG_CGDISPIPE                       ( 0x1u << 1 ) /**< \brief (XDMAC_GCFG) Pipeline Clock Gating Disable */
#define XDMAC_GCFG_CGDISFIFO                       ( 0x1u << 2 ) /**< \brief (XDMAC_GCFG) FIFO Clock Gating Disable */
#define XDMAC_GCFG_CGDISIF                         ( 0x1u << 3 ) /**< \brief (XDMAC_GCFG) Bus Interface Clock Gating Disable */
#define XDMAC_GCFG_BXKBEN                          ( 0x1u << 8 ) /**< \brief (XDMAC_GCFG) Boundary X Kilo byte Enable */
/* -------- XDMAC_GWAC : (XDMAC Offset: 0x08) Global Weighted Arbiter Configuration Register -------- */
#define XDMAC_GWAC_PW0_Pos                         0
#define XDMAC_GWAC_PW0_Msk                         ( 0xfu << XDMAC_GWAC_PW0_Pos ) /**< \brief (XDMAC_GWAC) Pool Weight 0 */
#define XDMAC_GWAC_PW0( value )    ( ( XDMAC_GWAC_PW0_Msk & ( ( value ) << XDMAC_GWAC_PW0_Pos ) ) )
#define XDMAC_GWAC_PW1_Pos                         4
#define XDMAC_GWAC_PW1_Msk                         ( 0xfu << XDMAC_GWAC_PW1_Pos ) /**< \brief (XDMAC_GWAC) Pool Weight 1 */
#define XDMAC_GWAC_PW1( value )    ( ( XDMAC_GWAC_PW1_Msk & ( ( value ) << XDMAC_GWAC_PW1_Pos ) ) )
#define XDMAC_GWAC_PW2_Pos                         8
#define XDMAC_GWAC_PW2_Msk                         ( 0xfu << XDMAC_GWAC_PW2_Pos ) /**< \brief (XDMAC_GWAC) Pool Weight 2 */
#define XDMAC_GWAC_PW2( value )    ( ( XDMAC_GWAC_PW2_Msk & ( ( value ) << XDMAC_GWAC_PW2_Pos ) ) )
#define XDMAC_GWAC_PW3_Pos                         12
#define XDMAC_GWAC_PW3_Msk                         ( 0xfu << XDMAC_GWAC_PW3_Pos ) /**< \brief (XDMAC_GWAC) Pool Weight 3 */
#define XDMAC_GWAC_PW3( value )    ( ( XDMAC_GWAC_PW3_Msk & ( ( value ) << XDMAC_GWAC_PW3_Pos ) ) )
/* -------- XDMAC_GIE : (XDMAC Offset: 0x0C) Global Interrupt Enable Register -------- */
#define XDMAC_GIE_IE0                              ( 0x1u << 0 )  /**< \brief (XDMAC_GIE) XDMAC Channel 0 Interrupt Enable Bit */
#define XDMAC_GIE_IE1                              ( 0x1u << 1 )  /**< \brief (XDMAC_GIE) XDMAC Channel 1 Interrupt Enable Bit */
#define XDMAC_GIE_IE2                              ( 0x1u << 2 )  /**< \brief (XDMAC_GIE) XDMAC Channel 2 Interrupt Enable Bit */
#define XDMAC_GIE_IE3                              ( 0x1u << 3 )  /**< \brief (XDMAC_GIE) XDMAC Channel 3 Interrupt Enable Bit */
#define XDMAC_GIE_IE4                              ( 0x1u << 4 )  /**< \brief (XDMAC_GIE) XDMAC Channel 4 Interrupt Enable Bit */
#define XDMAC_GIE_IE5                              ( 0x1u << 5 )  /**< \brief (XDMAC_GIE) XDMAC Channel 5 Interrupt Enable Bit */
#define XDMAC_GIE_IE6                              ( 0x1u << 6 )  /**< \brief (XDMAC_GIE) XDMAC Channel 6 Interrupt Enable Bit */
#define XDMAC_GIE_IE7                              ( 0x1u << 7 )  /**< \brief (XDMAC_GIE) XDMAC Channel 7 Interrupt Enable Bit */
#define XDMAC_GIE_IE8                              ( 0x1u << 8 )  /**< \brief (XDMAC_GIE) XDMAC Channel 8 Interrupt Enable Bit */
#define XDMAC_GIE_IE9                              ( 0x1u << 9 )  /**< \brief (XDMAC_GIE) XDMAC Channel 9 Interrupt Enable Bit */
#define XDMAC_GIE_IE10                             ( 0x1u << 10 ) /**< \brief (XDMAC_GIE) XDMAC Channel 10 Interrupt Enable Bit */
#define XDMAC_GIE_IE11                             ( 0x1u << 11 ) /**< \brief (XDMAC_GIE) XDMAC Channel 11 Interrupt Enable Bit */
#define XDMAC_GIE_IE12                             ( 0x1u << 12 ) /**< \brief (XDMAC_GIE) XDMAC Channel 12 Interrupt Enable Bit */
#define XDMAC_GIE_IE13                             ( 0x1u << 13 ) /**< \brief (XDMAC_GIE) XDMAC Channel 13 Interrupt Enable Bit */
#define XDMAC_GIE_IE14                             ( 0x1u << 14 ) /**< \brief (XDMAC_GIE) XDMAC Channel 14 Interrupt Enable Bit */
#define XDMAC_GIE_IE15                             ( 0x1u << 15 ) /**< \brief (XDMAC_GIE) XDMAC Channel 15 Interrupt Enable Bit */
#define XDMAC_GIE_IE16                             ( 0x1u << 16 ) /**< \brief (XDMAC_GIE) XDMAC Channel 16 Interrupt Enable Bit */
#define XDMAC_GIE_IE17                             ( 0x1u << 17 ) /**< \brief (XDMAC_GIE) XDMAC Channel 17 Interrupt Enable Bit */
#define XDMAC_GIE_IE18                             ( 0x1u << 18 ) /**< \brief (XDMAC_GIE) XDMAC Channel 18 Interrupt Enable Bit */
#define XDMAC_GIE_IE19                             ( 0x1u << 19 ) /**< \brief (XDMAC_GIE) XDMAC Channel 19 Interrupt Enable Bit */
#define XDMAC_GIE_IE20                             ( 0x1u << 20 ) /**< \brief (XDMAC_GIE) XDMAC Channel 20 Interrupt Enable Bit */
#define XDMAC_GIE_IE21                             ( 0x1u << 21 ) /**< \brief (XDMAC_GIE) XDMAC Channel 21 Interrupt Enable Bit */
#define XDMAC_GIE_IE22                             ( 0x1u << 22 ) /**< \brief (XDMAC_GIE) XDMAC Channel 22 Interrupt Enable Bit */
#define XDMAC_GIE_IE23                             ( 0x1u << 23 ) /**< \brief (XDMAC_GIE) XDMAC Channel 23 Interrupt Enable Bit */
/* -------- XDMAC_GID : (XDMAC Offset: 0x10) Global Interrupt Disable Register -------- */
#define XDMAC_GID_ID0                              ( 0x1u << 0 )  /**< \brief (XDMAC_GID) XDMAC Channel 0 Interrupt Disable Bit */
#define XDMAC_GID_ID1                              ( 0x1u << 1 )  /**< \brief (XDMAC_GID) XDMAC Channel 1 Interrupt Disable Bit */
#define XDMAC_GID_ID2                              ( 0x1u << 2 )  /**< \brief (XDMAC_GID) XDMAC Channel 2 Interrupt Disable Bit */
#define XDMAC_GID_ID3                              ( 0x1u << 3 )  /**< \brief (XDMAC_GID) XDMAC Channel 3 Interrupt Disable Bit */
#define XDMAC_GID_ID4                              ( 0x1u << 4 )  /**< \brief (XDMAC_GID) XDMAC Channel 4 Interrupt Disable Bit */
#define XDMAC_GID_ID5                              ( 0x1u << 5 )  /**< \brief (XDMAC_GID) XDMAC Channel 5 Interrupt Disable Bit */
#define XDMAC_GID_ID6                              ( 0x1u << 6 )  /**< \brief (XDMAC_GID) XDMAC Channel 6 Interrupt Disable Bit */
#define XDMAC_GID_ID7                              ( 0x1u << 7 )  /**< \brief (XDMAC_GID) XDMAC Channel 7 Interrupt Disable Bit */
#define XDMAC_GID_ID8                              ( 0x1u << 8 )  /**< \brief (XDMAC_GID) XDMAC Channel 8 Interrupt Disable Bit */
#define XDMAC_GID_ID9                              ( 0x1u << 9 )  /**< \brief (XDMAC_GID) XDMAC Channel 9 Interrupt Disable Bit */
#define XDMAC_GID_ID10                             ( 0x1u << 10 ) /**< \brief (XDMAC_GID) XDMAC Channel 10 Interrupt Disable Bit */
#define XDMAC_GID_ID11                             ( 0x1u << 11 ) /**< \brief (XDMAC_GID) XDMAC Channel 11 Interrupt Disable Bit */
#define XDMAC_GID_ID12                             ( 0x1u << 12 ) /**< \brief (XDMAC_GID) XDMAC Channel 12 Interrupt Disable Bit */
#define XDMAC_GID_ID13                             ( 0x1u << 13 ) /**< \brief (XDMAC_GID) XDMAC Channel 13 Interrupt Disable Bit */
#define XDMAC_GID_ID14                             ( 0x1u << 14 ) /**< \brief (XDMAC_GID) XDMAC Channel 14 Interrupt Disable Bit */
#define XDMAC_GID_ID15                             ( 0x1u << 15 ) /**< \brief (XDMAC_GID) XDMAC Channel 15 Interrupt Disable Bit */
#define XDMAC_GID_ID16                             ( 0x1u << 16 ) /**< \brief (XDMAC_GID) XDMAC Channel 16 Interrupt Disable Bit */
#define XDMAC_GID_ID17                             ( 0x1u << 17 ) /**< \brief (XDMAC_GID) XDMAC Channel 17 Interrupt Disable Bit */
#define XDMAC_GID_ID18                             ( 0x1u << 18 ) /**< \brief (XDMAC_GID) XDMAC Channel 18 Interrupt Disable Bit */
#define XDMAC_GID_ID19                             ( 0x1u << 19 ) /**< \brief (XDMAC_GID) XDMAC Channel 19 Interrupt Disable Bit */
#define XDMAC_GID_ID20                             ( 0x1u << 20 ) /**< \brief (XDMAC_GID) XDMAC Channel 20 Interrupt Disable Bit */
#define XDMAC_GID_ID21                             ( 0x1u << 21 ) /**< \brief (XDMAC_GID) XDMAC Channel 21 Interrupt Disable Bit */
#define XDMAC_GID_ID22                             ( 0x1u << 22 ) /**< \brief (XDMAC_GID) XDMAC Channel 22 Interrupt Disable Bit */
#define XDMAC_GID_ID23                             ( 0x1u << 23 ) /**< \brief (XDMAC_GID) XDMAC Channel 23 Interrupt Disable Bit */
/* -------- XDMAC_GIM : (XDMAC Offset: 0x14) Global Interrupt Mask Register -------- */
#define XDMAC_GIM_IM0                              ( 0x1u << 0 )  /**< \brief (XDMAC_GIM) XDMAC Channel 0 Interrupt Mask Bit */
#define XDMAC_GIM_IM1                              ( 0x1u << 1 )  /**< \brief (XDMAC_GIM) XDMAC Channel 1 Interrupt Mask Bit */
#define XDMAC_GIM_IM2                              ( 0x1u << 2 )  /**< \brief (XDMAC_GIM) XDMAC Channel 2 Interrupt Mask Bit */
#define XDMAC_GIM_IM3                              ( 0x1u << 3 )  /**< \brief (XDMAC_GIM) XDMAC Channel 3 Interrupt Mask Bit */
#define XDMAC_GIM_IM4                              ( 0x1u << 4 )  /**< \brief (XDMAC_GIM) XDMAC Channel 4 Interrupt Mask Bit */
#define XDMAC_GIM_IM5                              ( 0x1u << 5 )  /**< \brief (XDMAC_GIM) XDMAC Channel 5 Interrupt Mask Bit */
#define XDMAC_GIM_IM6                              ( 0x1u << 6 )  /**< \brief (XDMAC_GIM) XDMAC Channel 6 Interrupt Mask Bit */
#define XDMAC_GIM_IM7                              ( 0x1u << 7 )  /**< \brief (XDMAC_GIM) XDMAC Channel 7 Interrupt Mask Bit */
#define XDMAC_GIM_IM8                              ( 0x1u << 8 )  /**< \brief (XDMAC_GIM) XDMAC Channel 8 Interrupt Mask Bit */
#define XDMAC_GIM_IM9                              ( 0x1u << 9 )  /**< \brief (XDMAC_GIM) XDMAC Channel 9 Interrupt Mask Bit */
#define XDMAC_GIM_IM10                             ( 0x1u << 10 ) /**< \brief (XDMAC_GIM) XDMAC Channel 10 Interrupt Mask Bit */
#define XDMAC_GIM_IM11                             ( 0x1u << 11 ) /**< \brief (XDMAC_GIM) XDMAC Channel 11 Interrupt Mask Bit */
#define XDMAC_GIM_IM12                             ( 0x1u << 12 ) /**< \brief (XDMAC_GIM) XDMAC Channel 12 Interrupt Mask Bit */
#define XDMAC_GIM_IM13                             ( 0x1u << 13 ) /**< \brief (XDMAC_GIM) XDMAC Channel 13 Interrupt Mask Bit */
#define XDMAC_GIM_IM14                             ( 0x1u << 14 ) /**< \brief (XDMAC_GIM) XDMAC Channel 14 Interrupt Mask Bit */
#define XDMAC_GIM_IM15                             ( 0x1u << 15 ) /**< \brief (XDMAC_GIM) XDMAC Channel 15 Interrupt Mask Bit */
#define XDMAC_GIM_IM16                             ( 0x1u << 16 ) /**< \brief (XDMAC_GIM) XDMAC Channel 16 Interrupt Mask Bit */
#define XDMAC_GIM_IM17                             ( 0x1u << 17 ) /**< \brief (XDMAC_GIM) XDMAC Channel 17 Interrupt Mask Bit */
#define XDMAC_GIM_IM18                             ( 0x1u << 18 ) /**< \brief (XDMAC_GIM) XDMAC Channel 18 Interrupt Mask Bit */
#define XDMAC_GIM_IM19                             ( 0x1u << 19 ) /**< \brief (XDMAC_GIM) XDMAC Channel 19 Interrupt Mask Bit */
#define XDMAC_GIM_IM20                             ( 0x1u << 20 ) /**< \brief (XDMAC_GIM) XDMAC Channel 20 Interrupt Mask Bit */
#define XDMAC_GIM_IM21                             ( 0x1u << 21 ) /**< \brief (XDMAC_GIM) XDMAC Channel 21 Interrupt Mask Bit */
#define XDMAC_GIM_IM22                             ( 0x1u << 22 ) /**< \brief (XDMAC_GIM) XDMAC Channel 22 Interrupt Mask Bit */
#define XDMAC_GIM_IM23                             ( 0x1u << 23 ) /**< \brief (XDMAC_GIM) XDMAC Channel 23 Interrupt Mask Bit */
/* -------- XDMAC_GIS : (XDMAC Offset: 0x18) Global Interrupt Status Register -------- */
#define XDMAC_GIS_IS0                              ( 0x1u << 0 )  /**< \brief (XDMAC_GIS) XDMAC Channel 0 Interrupt Status Bit */
#define XDMAC_GIS_IS1                              ( 0x1u << 1 )  /**< \brief (XDMAC_GIS) XDMAC Channel 1 Interrupt Status Bit */
#define XDMAC_GIS_IS2                              ( 0x1u << 2 )  /**< \brief (XDMAC_GIS) XDMAC Channel 2 Interrupt Status Bit */
#define XDMAC_GIS_IS3                              ( 0x1u << 3 )  /**< \brief (XDMAC_GIS) XDMAC Channel 3 Interrupt Status Bit */
#define XDMAC_GIS_IS4                              ( 0x1u << 4 )  /**< \brief (XDMAC_GIS) XDMAC Channel 4 Interrupt Status Bit */
#define XDMAC_GIS_IS5                              ( 0x1u << 5 )  /**< \brief (XDMAC_GIS) XDMAC Channel 5 Interrupt Status Bit */
#define XDMAC_GIS_IS6                              ( 0x1u << 6 )  /**< \brief (XDMAC_GIS) XDMAC Channel 6 Interrupt Status Bit */
#define XDMAC_GIS_IS7                              ( 0x1u << 7 )  /**< \brief (XDMAC_GIS) XDMAC Channel 7 Interrupt Status Bit */
#define XDMAC_GIS_IS8                              ( 0x1u << 8 )  /**< \brief (XDMAC_GIS) XDMAC Channel 8 Interrupt Status Bit */
#define XDMAC_GIS_IS9                              ( 0x1u << 9 )  /**< \brief (XDMAC_GIS) XDMAC Channel 9 Interrupt Status Bit */
#define XDMAC_GIS_IS10                             ( 0x1u << 10 ) /**< \brief (XDMAC_GIS) XDMAC Channel 10 Interrupt Status Bit */
#define XDMAC_GIS_IS11                             ( 0x1u << 11 ) /**< \brief (XDMAC_GIS) XDMAC Channel 11 Interrupt Status Bit */
#define XDMAC_GIS_IS12                             ( 0x1u << 12 ) /**< \brief (XDMAC_GIS) XDMAC Channel 12 Interrupt Status Bit */
#define XDMAC_GIS_IS13                             ( 0x1u << 13 ) /**< \brief (XDMAC_GIS) XDMAC Channel 13 Interrupt Status Bit */
#define XDMAC_GIS_IS14                             ( 0x1u << 14 ) /**< \brief (XDMAC_GIS) XDMAC Channel 14 Interrupt Status Bit */
#define XDMAC_GIS_IS15                             ( 0x1u << 15 ) /**< \brief (XDMAC_GIS) XDMAC Channel 15 Interrupt Status Bit */
#define XDMAC_GIS_IS16                             ( 0x1u << 16 ) /**< \brief (XDMAC_GIS) XDMAC Channel 16 Interrupt Status Bit */
#define XDMAC_GIS_IS17                             ( 0x1u << 17 ) /**< \brief (XDMAC_GIS) XDMAC Channel 17 Interrupt Status Bit */
#define XDMAC_GIS_IS18                             ( 0x1u << 18 ) /**< \brief (XDMAC_GIS) XDMAC Channel 18 Interrupt Status Bit */
#define XDMAC_GIS_IS19                             ( 0x1u << 19 ) /**< \brief (XDMAC_GIS) XDMAC Channel 19 Interrupt Status Bit */
#define XDMAC_GIS_IS20                             ( 0x1u << 20 ) /**< \brief (XDMAC_GIS) XDMAC Channel 20 Interrupt Status Bit */
#define XDMAC_GIS_IS21                             ( 0x1u << 21 ) /**< \brief (XDMAC_GIS) XDMAC Channel 21 Interrupt Status Bit */
#define XDMAC_GIS_IS22                             ( 0x1u << 22 ) /**< \brief (XDMAC_GIS) XDMAC Channel 22 Interrupt Status Bit */
#define XDMAC_GIS_IS23                             ( 0x1u << 23 ) /**< \brief (XDMAC_GIS) XDMAC Channel 23 Interrupt Status Bit */
/* -------- XDMAC_GE : (XDMAC Offset: 0x1C) Global Channel Enable Register -------- */
#define XDMAC_GE_EN0                               ( 0x1u << 0 )  /**< \brief (XDMAC_GE) XDMAC Channel 0 Enable Bit */
#define XDMAC_GE_EN1                               ( 0x1u << 1 )  /**< \brief (XDMAC_GE) XDMAC Channel 1 Enable Bit */
#define XDMAC_GE_EN2                               ( 0x1u << 2 )  /**< \brief (XDMAC_GE) XDMAC Channel 2 Enable Bit */
#define XDMAC_GE_EN3                               ( 0x1u << 3 )  /**< \brief (XDMAC_GE) XDMAC Channel 3 Enable Bit */
#define XDMAC_GE_EN4                               ( 0x1u << 4 )  /**< \brief (XDMAC_GE) XDMAC Channel 4 Enable Bit */
#define XDMAC_GE_EN5                               ( 0x1u << 5 )  /**< \brief (XDMAC_GE) XDMAC Channel 5 Enable Bit */
#define XDMAC_GE_EN6                               ( 0x1u << 6 )  /**< \brief (XDMAC_GE) XDMAC Channel 6 Enable Bit */
#define XDMAC_GE_EN7                               ( 0x1u << 7 )  /**< \brief (XDMAC_GE) XDMAC Channel 7 Enable Bit */
#define XDMAC_GE_EN8                               ( 0x1u << 8 )  /**< \brief (XDMAC_GE) XDMAC Channel 8 Enable Bit */
