FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M7_SAMV71_Xplained_IAR_Keil/libchip_samv7/include/samv7/component/component_xdmac.h
#define XDMAC_CC_PERID( value )    ( ( XDMAC_CC_PERID_Msk & ( ( value ) << XDMAC_CC_PERID_Pos ) ) )
/* -------- XDMAC_CDS_MSP : (XDMAC Offset: N/A) Channel Data Stride Memory Set Pattern -------- */
#define XDMAC_CDS_MSP_SDS_MSP_Pos                  0
#define XDMAC_CDS_MSP_SDS_MSP_Msk                  ( 0xffffu << XDMAC_CDS_MSP_SDS_MSP_Pos ) /**< \brief (XDMAC_CDS_MSP) Channel x Source Data stride or Memory Set Pattern */
#define XDMAC_CDS_MSP_SDS_MSP( value )    ( ( XDMAC_CDS_MSP_SDS_MSP_Msk & ( ( value ) << XDMAC_CDS_MSP_SDS_MSP_Pos ) ) )
#define XDMAC_CDS_MSP_DDS_MSP_Pos                  16
#define XDMAC_CDS_MSP_DDS_MSP_Msk                  ( 0xffffu << XDMAC_CDS_MSP_DDS_MSP_Pos ) /**< \brief (XDMAC_CDS_MSP) Channel x Destination Data Stride or Memory Set Pattern */
#define XDMAC_CDS_MSP_DDS_MSP( value )    ( ( XDMAC_CDS_MSP_DDS_MSP_Msk & ( ( value ) << XDMAC_CDS_MSP_DDS_MSP_Pos ) ) )
/* -------- XDMAC_CSUS : (XDMAC Offset: N/A) Channel Source Microblock Stride -------- */
#define XDMAC_CSUS_SUBS_Pos                        0
#define XDMAC_CSUS_SUBS_Msk                        ( 0xffffffu << XDMAC_CSUS_SUBS_Pos ) /**< \brief (XDMAC_CSUS) Channel x Source Microblock Stride */
#define XDMAC_CSUS_SUBS( value )    ( ( XDMAC_CSUS_SUBS_Msk & ( ( value ) << XDMAC_CSUS_SUBS_Pos ) ) )
/* -------- XDMAC_CDUS : (XDMAC Offset: N/A) Channel Destination Microblock Stride -------- */
#define XDMAC_CDUS_DUBS_Pos                        0
#define XDMAC_CDUS_DUBS_Msk                        ( 0xffffffu << XDMAC_CDUS_DUBS_Pos ) /**< \brief (XDMAC_CDUS) Channel x Destination Microblock Stride */
#define XDMAC_CDUS_DUBS( value )    ( ( XDMAC_CDUS_DUBS_Msk & ( ( value ) << XDMAC_CDUS_DUBS_Pos ) ) )
/* -------- XDMAC_VERSION : (XDMAC Offset: 0xFFC) XDMAC Version Register -------- */
#define XDMAC_VERSION_VERSION_Pos                  0
#define XDMAC_VERSION_VERSION_Msk                  ( 0xfffu << XDMAC_VERSION_VERSION_Pos ) /**< \brief (XDMAC_VERSION) Version of the Hardware Module */
#define XDMAC_VERSION_VERSION( value )    ( ( XDMAC_VERSION_VERSION_Msk & ( ( value ) << XDMAC_VERSION_VERSION_Pos ) ) )
#define XDMAC_VERSION_MFN_Pos                      16
#define XDMAC_VERSION_MFN_Msk                      ( 0x7u << XDMAC_VERSION_MFN_Pos ) /**< \brief (XDMAC_VERSION) Metal Fix Number */
#define XDMAC_VERSION_MFN( value )        ( ( XDMAC_VERSION_MFN_Msk & ( ( value ) << XDMAC_VERSION_MFN_Pos ) ) )

/*@}*/


#endif /* _SAM_XDMAC_COMPONENT_ */
